08. 데이터 선택 (iloc)
   위치를 이용하여 원하는 행에서 원하는 칼럼 선택

In [1]:
import pandas as pd 
df = pd.read_csv('score.csv')
df

  지원번호   이름   학교    키   국어  영어   수학  과학  사회        SW특기
0   1번  채치수  북산고  197   90  85  100  85  85      Python
1   2번  정대만  북산고  184   40  35   55  35  45        Java
2   3번  송태섭  북산고  168   85  90   75  75  65  JavaScript
3   4번  서태웅  북산고  198   50  60   80  75  80         NaN
4   5번  강백호  북산고  186   70  80   85  80  85         NaN
5   6번  변덕규  능남고  160   80  90   90  90  75           C
6   7번  황태산  능남고  169   90  60   80  95  90      Python
7   8번  윤대협  능남고  190  100  80   90  95  85          C#

In [2]:
df.iloc[0]   #0반쩨 위치의 데이터

지원번호        1번
이름         채치수
학교         북산고
키          197
국어          90
영어          85
수학         100
과학          85
사회          85
SW특기    Python
Name: 0, dtype: object

In [3]:
df.iloc[4]

지원번호     5번
이름      강백호
학교      북산고
키       186
국어       70
영어       80
수학       85
과학       80
사회       85
SW특기    NaN
Name: 4, dtype: object

In [4]:
df.iloc[0:5]  #0-4번째 위치의 데이터

  지원번호   이름   학교    키  국어  영어   수학  과학  사회        SW특기
0   1번  채치수  북산고  197  90  85  100  85  85      Python
1   2번  정대만  북산고  184  40  35   55  35  45        Java
2   3번  송태섭  북산고  168  85  90   75  75  65  JavaScript
3   4번  서태웅  북산고  198  50  60   80  75  80         NaN
4   5번  강백호  북산고  186  70  80   85  80  85         NaN

In [5]:
df.iloc[0,1]  #0번째 위치의 1번째(이름) 데이터

'채치수'

In [7]:
df.iloc[4,2]  #5번째 학생의 1번째 데이터

'북산고'

In [8]:
df.iloc[[0,1],[3,4]]   #0,1번째 위치의 학생의 3,4번쨰 데이터 가져오기

     키  국어
0  197  90
1  184  40

In [9]:
df.iloc[0:5, 3:8] #0-4번째 위치의 학생 중에서, 3-7번째 데이터 가져오기

     키  국어  영어   수학  과학
0  197  90  85  100  85
1  184  40  35   55  35
2  168  85  90   75  75
3  198  50  60   80  75
4  186  70  80   85  80